modules/jemacs_note_taking_lp.org
#+TITLE: jemacs-note-taking.el
#+PROPERTY: header-args:emacs-lisp :tangle ./jemacs-note-taking.el :mkdirp yes


* setup

  #+begin_src emacs-lisp
    ;;; mycraft --- Summary  -*- lexical-binding: t; -*-
    ;;; Copyright (C) 2020 mycraft maintainers
    ;;; Author: Jing
    ;;; package --- mycraft
    ;;; Commentary:

    ;;; Code:


  #+end_src

* org

  https://orgmode.org/worg/org-contrib/org-drill.html

  we can check the org's version by the command =org-version=

  #+begin_src emacs-lisp
    (use-package org-ql
      :defer t)

    (use-package org-drill
      :defer t)

    (use-package org
      :defer t
      :init

      (setq-default safe-local-variable-values
                    '((org-reveal-ignore-speaker-notes . (lambda (x) t))
                      (org-confirm-babel-evaluate . (lambda (x) t))
                      (eval . (progn
                                (when
                                    (and (not (equal buffer-file-name nil))
                                         (equal
                                          (string-match
                                           (regexp-quote org-roam-directory)
                                           (regexp-quote buffer-file-name))
                                          nil))
                                  (setq org-roam-directory (locate-dominating-file default-directory ".dir-locals.el"))
                                  (setq org-roam-db-location (concat org-roam-directory "org-roam.db")))))
                      (org-export-babel-evaluate . (lambda (x) t))))
      :custom
      ;; cool! some functions need to be enable
      ;; like <s press tab to complete org structure (org-tempo)
      ;; these variables can be found in the source code of org.el
      (org-pretty-entities t) ;; org-toggle-pretty-entities

      (org-link-descriptive t)
      (org-modules '(ol-w3m
                     ol-bbdb
                     ol-bibtex
                     ol-docview
                     ol-gnus
                     ol-info
                     ol-irc
                     ol-mhe
                     ol-rmail
                     ol-eww
                     org-habit
                     ol-git-link
                     org-protocol
                     org-tempo))


      ;; to produce font-face for org quote block
      (org-fontify-quote-and-verse-blocks t)
      ;; hide the empasis syntax ex. *hi* -> bold hi
      (org-hide-emphasis-markers t)
      ;; use indent-line-function to
      ;; see the indentation function used by org-mode
      ;; check the doc of org-indent-line, know how indent works
      (org-adapt-indentation t)
      ;; this will make org-shift to auto add timestamp after making a toto item complete
      (org-log-done 'time)
      (org-startup-truncated nil)
      (org-export-backends '(ascii html icalendar latex odt md))

      (org-id-locations-file (expand-file-name "org.org-id-locations" user-emacs-directory))

      (org-image-actual-width nil)
      ;; org-edit-src without prompting window
      (org-src-window-setup 'current-window)
      (org-startup-folded t)
      (org-startup-with-inline-images t)

      (org-agenda-use-tag-inheritance nil)
      (org-hide-leading-stars t)

      :config
      (require 'org-indent)
      (keymap-unset org-mode-map "C-'" t)
      ;; (setq org-ellipsis " ▾")
      (setq-default org-default-notes-file
                    "~/Dropbox/myorgs/todo.org")


      :ensure org-contrib)

    (use-package org-tree-slide
      :defer t
      :custom
      (org-image-actual-iwth nil))

    (use-package org-download
      :commands
      (org-download-screenshot
       org-download-clipboard)
      :custom
      (org-download-screenshot-method "screencapture -i %s")
      (org-download-image-org-width 500)
      (org-download-image-dir "./img")
      :defer t)

    (use-package org-journal
      :defer t)

    (use-package ox-reveal
      :after org)

    (use-package org-superstar
      :hook (org-mode . org-superstar-mode))

    (defun presentation-setup ()
      ;; Scale the text.  The next line is for basic scaling:
      (with-eval-after-load 'face-remap
        (setq text-scale-mode-amount 3)
        (text-scale-mode 1)))

    (defun presentation-end ()
      ;; Show the mode line again
      (setq text-scale-mode-amount 0)
      (text-scale-mode 0))


    (use-package org-tree-slide
      :defer t
      :hook ((org-tree-slide-play . presentation-setup)
             (org-tree-slide-stop . presentation-end))
      :custom
      (org-tree-slide-slide-in-effect t)
      (org-tree-slide-header t)
      (org-tree-slide-breadcrumbs " > ")
      (org-image-actual-iwth nil))

    (use-package visual-fill-column
      :init
      (setq visual-fill-column-width 150)
      (setq visual-fill-column-center-text t)
      :hook (org-mode . org-mode-visual-fill))

  #+end_src

* htmlize

  it's required when you want the html exported by =org-export= with syntax highlight effect.

  #+begin_src emacs-lisp
    (use-package htmlize
      :defer t)
  #+end_src

* org-roam

  This requires =sqlite3=. Ensure it's installed.

  Remember to run =org-roam-db-build-cache= at first time.

  #+begin_src emacs-lisp
    (defun my-org-roam-fontify-like-in-org-mode (s)
      "Fontify string S like in Org mode.
    Like `org-fontify-like-in-org-mode', but supports `org-ref'."
      (with-temp-buffer
        (insert s)
        (let ((org-ref-buffer-hacked t))
          (org-mode)
          (org-font-lock-ensure)
          (if org-link-descriptive
              (org-link-display-format (buffer-string))
          (buffer-string)))))

    (use-package org-roam
      :straight
      (:host github :repo "org-roam/org-roam" :files (:defaults "extensions/*"))
      :after org
      :custom
      (org-roam-directory "/Users/jing/Dropbox/myorgs/life_books_courses_programming/")
      (org-roam-db-location (concat org-roam-directory "org-roam.db"))
      (org-roam-completion-everywhere t)
      :init
      (setq org-roam-v2-ack t)
      (defalias 'org-font-lock-ensure
        (if (fboundp 'font-lock-ensure)
            #'font-lock-ensure
          (lambda (&optional _beg _end)
            (with-no-warnings (font-lock-fontify-buffer)))))
      :config
      (advice-add 'org-roam-fontify-like-in-org-mode :override #'my-org-roam-fontify-like-in-org-mode)
      (setq completion-ignore-case t) ;; make ivy completion case insensitive
      (setq org-roam-node-display-template (concat
                                            "${title:100}" (propertize "${tags:30}" 'face 'org-tag)))
      (setq org-roam-dailies-capture-templates
            `(("d" "default" entry
               "* %<%H:%M> %?"
               :target (file+head "%<%Y-%m-%d>.org"
                                  "#+title: %<%Y-%m-%d>\n#+filetags: :daily:"))))
      (setq org-roam-capture-templates
            `(("d" "default" plain "%?" :target
               (file+head "${slug}.org" "#+title: ${title}\n")
               :unnarrowed t)))
      (setq org-roam-dailies-directory "journal/")
      (org-roam-db-autosync-enable))


    (use-package org-roam-ui
      :straight
        (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
        :after org-roam
        :config
        (setq org-roam-ui-sync-theme t
              org-roam-ui-follow t
              org-roam-ui-update-on-save t
              org-roam-ui-open-on-start nil))

    (with-eval-after-load 'counsel
      (defun org-roam-todo ()
        "An ad-hoc agenda for `org-roam'."
        (interactive)
        (let* ((regex "^\\* TODO")
               (b (get-buffer (concat "*ivy-occur counsel-rg \"" regex "\"*"))))
          (if b
              (progn
                (switch-to-buffer b)
                (ivy-occur-revert-buffer))
            (setq unread-command-events (listify-key-sequence (kbd "C-c C-o M->")))
            (counsel-rg regex org-roam-directory "--sort modified")))))


    (defun ora-org-roam-find-file-action (x)
      (if (consp x)
          (let ((file-path (plist-get (cdr x) :path)))
            (org-roam--find-file file-path))
        (let* ((title-with-tags x)
               (org-roam-capture--info
                `((title . ,title-with-tags)
                  (slug . ,(funcall org-roam-title-to-slug-function title-with-tags))))
               (org-roam-capture--context 'title))
          (setq org-roam-capture-additional-template-props (list :finalize 'find-file))
          (org-roam-capture--capture))))

    (defun ora-org-roam-find-file ()
      (interactive)
      (unless org-roam-mode (org-roam-mode))
      (ivy-read "File: " (org-roam--get-title-path-completions)
                :action #'ora-org-roam-find-file-action
                :caller 'ora-org-roam-find-file))
  #+end_src

* ob-async
  #+begin_src emacs-lisp
    (use-package ob-async
      :defer t)
  #+end_src

* toc-org
  #+begin_src emacs-lisp
    (use-package toc-org
      :defer t
      :hook
      (org-mode . toc-org-mode)
      (markdown-mode . toc-org-mode)
      :commands (toc-org-insert-toc))
  #+end_src

