modules/jemacs_note_taking_lp.org
* evil-org

  By default, you need to press M-RET to add a auto-numbering list
  this will has some agenda mode binding..

  If you want the key binding for org-agenda-mode, add the following settings.

  #+begin_src emacs-lisp :tangle no
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)
  #+end_src


  #+begin_src emacs-lisp
    (use-package evil-org
      :after org
      :hook
      (org-mode . evil-org-mode)
      (evil-org-mode . (lambda ()
                         (evil-org-set-key-theme))))
  #+end_src

* restclient
  #+begin_src emacs-lisp
    (use-package restclient
      :defer t)

    (use-package ob-restclient
      :defer t
      :after (org restclient)
      :init (add-to-list 'org-babel-load-languages '(restclient . t)))
  #+end_src

* org password manager

  #+begin_src emacs-lisp
    (defvar pair-list nil) ;; a property list

    (defun iterate-org-level (&optional input)
      (interactive)
      ;; we need to escape the space in the property
      ;; ex. (setq a '(:abc\ cde 1))
      (require 'epa-file)
      (require 'org-element)
      (with-temp-buffer
        (epa-file-insert-file-contents "~/Dropbox/myorgs/management/learning.org.gpg")
        (setq pair-list nil)
        (cl-loop for i from 0
                 for ele in (org-element-parse-buffer 'headline)
                 when (and (> i 0) (not (equal ele nil)))
                 do (let* ((prop (plist-get ele 'headline))
                           (domain (plist-get prop :DOMAIN))
                           (title (plist-get prop :title))
                           (pass (plist-get prop :SECRET)))

                      (setq pair-list (plist-put pair-list (intern (message ":%s--%s" title domain)) pass))))
        (cl-loop for i from 0 for ele in pair-list
                 when (cl-evenp i) collect ele)))


    (defun get-se-action (x)
      (kill-new
       (base64-decode-string
        (decode-coding-string
         (plist-get pair-list (intern x)) 'utf-8)))
      (message "success"))

    (defun get-secret ()
      (interactive)
      (ivy-read "choose: " (iterate-org-level)
                :action #'get-se-action
                :caller 'get-secret))

  #+end_src

* org copy subtree's content

  #+begin_src emacs-lisp
    (defun org-copy-subtree-content (&optional n)
      "copy subtree content without header"
      (interactive "p")
      (print n) ;; it's weird sometime the vertico minibuffer will be stucked
      ;; but with this, it can resolve that problem.
      (save-excursion
        (org-back-to-heading)
        (forward-line)
        (let ((beg (point))
              (end (point)))
          (outline-end-of-subtree)
          (setq end (point))
          (kill-new (buffer-substring-no-properties beg end)))))
  #+end_src

* org-insert-toc
  FUTURE: maybe we can enhance this with prompting like org-insert-link
  #+begin_src emacs-lisp
    (defun org-insert-toc ()
      "Insert table of content for org mode."
      (interactive)
      (beginning-of-line)
      (insert "*" " " ":TOC:")
      (backward-char 5)
      (evil-insert-state))
  #+end_src

* org journal stock
  #+begin_src emacs-lisp
    (defun create-journal-to (dest)
      "~/Dropbox/myorgs/stock/journal"
      (let ((org-journal-dir dest))
        (call-interactively 'org-journal-new-entry)))
  #+end_src

* org table configuration

  #+begin_src emacs-lisp
    (with-eval-after-load 'org
      (defcustom org-html-tableel-org "no"
        "Export table.el cells as org code if set to \"t\" or \"yes\".
    This is the default and can be changed per section with export option:
    ,#+OPTIONS: HTML_TABLEEL_ORG: t"
        :type '(choice (const "no") (const "yes"))
        :group 'org-html)

      (eval-after-load 'ox-html
        '(eval ;;< Avoid eager macro expansion before ox-html is loaded.
          '(cl-pushnew
            (list
             :html-tableel-org
             "HTML_TABLEEL_ORG" ;; keyword
             "HTML_TABLEEL_ORG" ;; option for #+OPTIONS: line
             org-html-tableel-org ;; default value for the property
             t ;; handling of multiple keywords for the same property. (Replace old value with new one.)
             )
            (org-export-backend-options (org-export-get-backend 'html)))))

      (defvar org-element-all-elements) ;; defined in "org-element"
      (defun table-generate-orghtml-cell-contents (dest-buffer language cell info)
        "Generate and insert source cell contents of a CELL into DEST-BUFFER.
    LANGUAGE must be 'orghtml."
        (cl-assert (eq language 'html) nil
                   "Table cells with org content only working with html export")
        (let* ((cell-contents (extract-rectangle (car cell) (cdr cell)))
               (string (with-temp-buffer
                         (table--insert-rectangle cell-contents)
                         (table--remove-cell-properties (point-min) (point-max))
                         (goto-char (point-min))
                         (buffer-substring (point-min) (point-max)))))
          (with-current-buffer dest-buffer
            (let ((beg (point)))
              (insert (org-export-string-as string 'html t info))
              (indent-rigidly beg (point) 6)))))

      (defun my-org-html-table--table.el-table (table _info)
        "Format table.el tables into HTML.
    INFO is a plist used as a communication channel."
        (when (eq (org-element-property :type table) 'table.el)
          (require 'table)
          (let ((outbuf (with-current-buffer
                            (get-buffer-create "*org-export-table*")
                          (erase-buffer) (current-buffer))))
            (with-temp-buffer
              (insert (org-element-property :value table))
              (goto-char 1)
              (re-search-forward "^[ \t]*|[^|]" nil t)
              (table-recognize-region (point-min) (point-max) 1)
              (table-generate-source 'html outbuf))
            (with-current-buffer outbuf
              (prog1 (org-trim (buffer-string))
                (kill-buffer))))))

      (defun org-orghtml-table--table.el-table (fun table info)
        "Format table.el TABLE into HTML.
    This is an advice for `org-html-table--table.el-table' as FUN.
    INFO is a plist used as a communication channel."
        (if (assoc-string (plist-get info :html-tableel-org) '("t" "yes"))
            (cl-letf (((symbol-function 'table--generate-source-cell-contents)
                       (lambda (dest-buffer language cell)
                         (table-generate-orghtml-cell-contents dest-buffer language cell info))))
              (funcall fun table info))
          (funcall fun table info)))

      (advice-add 'org-html-table--table.el-table :override #'my-org-html-table--table.el-table)
      (advice-add #'my-org-html-table--table.el-table :around #'org-orghtml-table--table.el-table))
  #+end_src

